def count_letters(str_):
    str_ = str_.lower()
    dict_ = dict()

    for item in range(len(str_)):
        con = 0
        if str_[item].isalpha():
            for i in range(len(str_)):
                if str_[i] == str_[item]:
                    con += 1

            dict_[str_[item]] = con
    return dict_


def calculate_frequency(dict_):
    len_ = sum(dict_.values())

    for key, item in dict_.items():
        dict_[key] = item / len_

    return dict_


main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""

dict_ = calculate_frequency(count_letters(main_str))
for key, item in dict_.items():
    print(f"{key}: {item:.2f}")